#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_secretsmanager_secret.secret: Reading...
aws_route53_zone.thomaskimble_zone: Refreshing state... [id=Z06242472H0DG7GFLG30T]
aws_api_gateway_resource.get_projects: Refreshing state... [id=tqiml1]
aws_api_gateway_rest_api.thomaskimble: Refreshing state... [id=jdub5r46se]
aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/29037fba-829c-4870-9979-4b1574a8c6fd]
aws_route53_record.thomaskimble_outlook_autodiscover_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_autodiscover_CNAME]
aws_route53_record.thomaskimble_outlook_mx_record: Refreshing state... [id=Z06242472H0DG7GFLG30T__MX]
aws_route53_record.thomaskimble_txt_records: Refreshing state... [id=Z06242472H0DG7GFLG30T__TXT]
aws_route53_record.thomaskimble_email_secureserver_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_email_CNAME]
aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_legacy_CNAME]
data.aws_secretsmanager_secret.secret: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
data.aws_secretsmanager_secret_version.current: Reading...
aws_api_gateway_method.get_method: Refreshing state... [id=agm-jdub5r46se-tqiml1-GET]
aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d393xlsrttjy5b]
aws_api_gateway_method_response.get_method_response: Refreshing state... [id=agmr-jdub5r46se-tqiml1-GET-200]
aws_api_gateway_integration_response.get_integration_response: Refreshing state... [id=agir-jdub5r46se-tqiml1-GET-200]
aws_api_gateway_integration.get_integration: Refreshing state... [id=agi-jdub5r46se-tqiml1-GET]
aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_api_gateway_deployment.api_deployment: Refreshing state... [id=2my7jd]
aws_api_gateway_stage.prod: Refreshing state... [id=ags-jdub5r46se-prod]
aws_amplify_branch.main: Refreshing state... [id=d393xlsrttjy5b/main]
aws_amplify_branch.dev: Refreshing state... [id=d393xlsrttjy5b/dev]
aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d393xlsrttjy5b/thomaskimble.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_deployment" {
      ~ created_date  = "2024-05-15T10:37:14Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-1:287212251408:jdub5r46se/" -> (known after apply)
      ~ id            = "2my7jd" -> (known after apply)
      ~ invoke_url    = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "21970fd3dc343b7d80dc1fce8c3fe02cd0746c33"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration.get_integration must be replaced
+/- resource "aws_api_gateway_integration" "get_integration" {
      - cache_key_parameters = [] -> null
      ~ cache_namespace      = "tqiml1" -> (known after apply)
      ~ id                   = "agi-jdub5r46se-tqiml1-GET" -> (known after apply)
      - request_parameters   = {} -> null
      ~ resource_id          = "tqiml1" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_api_gateway_integration_response.get_integration_response must be replaced
+/- resource "aws_api_gateway_integration_response" "get_integration_response" {
      ~ id                  = "agir-jdub5r46se-tqiml1-GET-200" -> (known after apply)
      ~ resource_id         = "tqiml1" # forces replacement -> (known after apply) # forces replacement
      - response_parameters = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_api_gateway_method.get_method must be replaced
+/- resource "aws_api_gateway_method" "get_method" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-jdub5r46se-tqiml1-GET" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "tqiml1" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_api_gateway_method_response.get_method_response must be replaced
+/- resource "aws_api_gateway_method_response" "get_method_response" {
      ~ id                  = "agmr-jdub5r46se-tqiml1-GET-200" -> (known after apply)
      ~ resource_id         = "tqiml1" # forces replacement -> (known after apply) # forces replacement
      - response_parameters = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.get_about will be created
  + resource "aws_api_gateway_resource" "get_about" {
      + id          = (known after apply)
      + parent_id   = "xgj8bev4al"
      + path        = (known after apply)
      + path_part   = "GetAbout"
      + rest_api_id = "jdub5r46se"
    }

  # aws_api_gateway_resource.get_projects will be destroyed
  # (because aws_api_gateway_resource.get_projects is not in configuration)
  - resource "aws_api_gateway_resource" "get_projects" {
      - id          = "tqiml1" -> null
      - parent_id   = "xgj8bev4al" -> null
      - path        = "/GetProjects" -> null
      - path_part   = "GetProjects" -> null
      - rest_api_id = "jdub5r46se" -> null
    }

  # aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "2my7jd" -> (known after apply)
        id                    = "ags-jdub5r46se-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 6 to add, 1 to change, 6 to destroy.

Changes to Outputs:
  ~ api_deployment_arn = "arn:aws:execute-api:eu-west-1:287212251408:jdub5r46se/" -> (known after apply)
  ~ api_endpoint       = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/prod/GetProjects" -> "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/prod/GetAbout"
  ~ api_gateway_url    = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*